In [2]:
import pandas as pd

# Memory optimization on dataset

In [14]:
df = pd.read_csv('datasets/employees.csv')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
First Name           933 non-null object
Gender               855 non-null object
Start Date           1000 non-null object
Last Login Time      1000 non-null object
Salary               1000 non-null int64
Bonus %              1000 non-null float64
Senior Management    933 non-null object
Team                 957 non-null object
dtypes: float64(1), int64(1), object(6)
memory usage: 62.6+ KB

In [2]:
df = pd.read_csv('datasets/employees.csv', parse_dates=['Start Date', 'Last Login Time'])
df['Senior Management'] = df['Senior Management'].astype('bool')
df['Gender'] = df['Gender'].astype('category')
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2019-05-28 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2019-05-28 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2019-05-28 11:17:00,130590,11.858,False,Finance

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
First Name           933 non-null object
Gender               855 non-null category
Start Date           1000 non-null datetime64[ns]
Last Login Time      1000 non-null datetime64[ns]
Salary               1000 non-null int64
Bonus %              1000 non-null float64
Senior Management    1000 non-null bool
Team                 957 non-null object
dtypes: bool(1), category(1), datetime64[ns](2), float64(1), int64(1), object(2)
memory usage: 49.0+ KB

# Filter a dataframe based on a condition

In [2]:
df = pd.read_csv('datasets/employees.csv', parse_dates=['Start Date', 'Last Login Time'])
df['Senior Management'] = df['Senior Management'].astype('bool')
df['Gender'] = df['Gender'].astype('category')

In [8]:
df[df['Gender'] == 'Male'].head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2019-05-28 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2019-05-28 06:53:00,61933,4.170,True,NaN
3,Jerry,Male,2005-03-04,2019-05-28 13:00:00,138705,9.340,True,Finance

In [12]:
mask = df['Team'] == 'Finance'
df[mask].head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
2,Maria,Female,1993-04-23,2019-05-28 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2019-05-28 13:00:00,138705,9.340,True,Finance
7,NaN,Female,2015-07-20,2019-05-28 10:43:00,45906,11.598,True,Finance

In [15]:
mask = df['Salary'] >110000
df[mask].head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
2,Maria,Female,1993-04-23,2019-05-28 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2019-05-28 13:00:00,138705,9.340,True,Finance
5,Dennis,Male,1987-04-18,2019-05-28 01:35:00,115163,10.125,False,Legal

In [4]:
mask = df['Start Date'] <= '1995-06-03'
df[mask].head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2019-05-30 12:42:00,97308,6.945,True,Marketing
2,Maria,Female,1993-04-23,2019-05-30 11:17:00,130590,11.858,False,Finance
5,Dennis,Male,1987-04-18,2019-05-30 01:35:00,115163,10.125,False,Legal

In [9]:
is_male = df['Gender'] == 'Male'
is_marketing = df['Team'] == 'Marketing'

df[is_male & is_marketing].head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2019-05-30 12:42:00,97308,6.945,True,Marketing
21,Matthew,Male,1995-09-05,2019-05-30 02:12:00,100612,13.645,False,Marketing
26,Craig,Male,2000-02-27,2019-05-30 07:45:00,37598,7.757,True,Marketing

In [10]:
df[is_male | is_marketing].head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2019-05-30 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2019-05-30 06:53:00,61933,4.170,True,NaN
3,Jerry,Male,2005-03-04,2019-05-30 13:00:00,138705,9.340,True,Finance

# The .isin() method

In [11]:
df = pd.read_csv('datasets/employees.csv', parse_dates=['Start Date', 'Last Login Time'])
df['Senior Management'] = df['Senior Management'].astype('bool')
df['Gender'] = df['Gender'].astype('category')

In [13]:
mask = df['Team'].isin(['Legal', 'Sales', 'Product'])
df[mask].head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
5,Dennis,Male,1987-04-18,2019-05-30 01:35:00,115163,10.125,False,Legal
6,Ruby,Female,1987-08-17,2019-05-30 16:20:00,65476,10.012,True,Product
11,Julie,Female,1997-10-26,2019-05-30 15:19:00,102508,12.637,True,Legal

# The .isnull() and .notnull() method

In [14]:
df = pd.read_csv('datasets/employees.csv', parse_dates=['Start Date', 'Last Login Time'])
df['Senior Management'] = df['Senior Management'].astype('bool')
df['Gender'] = df['Gender'].astype('category')

In [16]:
mask = df['Team'].isnull()
df[mask].head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
1,Thomas,Male,1996-03-31,2019-05-30 06:53:00,61933,4.170,True,NaN
10,Louise,Female,1980-08-12,2019-05-30 09:01:00,63241,15.132,True,NaN
23,NaN,Male,2012-06-14,2019-05-30 16:19:00,125792,5.042,True,NaN

In [17]:
mask = df['Team'].notnull()
df[mask].head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2019-05-30 12:42:00,97308,6.945,True,Marketing
2,Maria,Female,1993-04-23,2019-05-30 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2019-05-30 13:00:00,138705,9.340,True,Finance

# The .between() method

In [18]:
df = pd.read_csv('datasets/employees.csv', parse_dates=['Start Date', 'Last Login Time'])
df['Senior Management'] = df['Senior Management'].astype('bool')
df['Gender'] = df['Gender'].astype('category')

In [20]:
mask = df['Salary'].between(60000, 70000)
df[mask].head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
1,Thomas,Male,1996-03-31,2019-05-30 06:53:00,61933,4.170,True,NaN
6,Ruby,Female,1987-08-17,2019-05-30 16:20:00,65476,10.012,True,Product
10,Louise,Female,1980-08-12,2019-05-30 09:01:00,63241,15.132,True,NaN

# The .duplicated() method

In [21]:
df = pd.read_csv('datasets/employees.csv', parse_dates=['Start Date', 'Last Login Time'])
df['Senior Management'] = df['Senior Management'].astype('bool')
df['Gender'] = df['Gender'].astype('category')

In [30]:
mask = df['First Name'].duplicated(keep=False)
df[mask].head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2019-05-30 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2019-05-30 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2019-05-30 11:17:00,130590,11.858,False,Finance

In [31]:
mask = ~df['First Name'].duplicated(keep=False)
df[mask].head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
5,Dennis,Male,1987-04-18,2019-05-30 01:35:00,115163,10.125,False,Legal
8,Angela,Female,2005-11-22,2019-05-30 06:29:00,95570,18.523,True,Engineering
33,Jean,Female,1993-12-18,2019-05-30 09:07:00,119082,16.180,False,Business Development

# The .drop_duplicates() method

In [3]:
df = pd.read_csv('datasets/employees.csv', parse_dates=['Start Date', 'Last Login Time'])
df['Senior Management'] = df['Senior Management'].astype('bool')
df['Gender'] = df['Gender'].astype('category')
df.sort_values('First Name', inplace=True)

In [4]:
len(df)

1000

In [5]:
len(df.drop_duplicates())

1000

In [6]:
len(df.drop_duplicates(subset=['First Name'], keep=False))

9

# The .unique() and .nunique() methods

In [8]:
df = pd.read_csv('datasets/employees.csv', parse_dates=['Start Date', 'Last Login Time'])
df['Senior Management'] = df['Senior Management'].astype('bool')
df['Gender'] = df['Gender'].astype('category')

In [10]:
df['Gender'].unique()

[Male, Female, NaN]
Categories (2, object): [Male, Female]

In [11]:
df['Team'].unique()

array(['Marketing', nan, 'Finance', 'Client Services', 'Legal', 'Product',
       'Engineering', 'Business Development', 'Human Resources', 'Sales',
       'Distribution'], dtype=object)

In [13]:
df['Team'].nunique(dropna=False)

11